Documents/algorithms/shortest-path-problems.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-01-03 Thu 23:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Shortest Path Problems</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="xiaoyao" />
</head>
<body>
<div id="content">
<h1 class="title">Shortest Path Problems</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org05b87dc">1. Single Source Shortest Path Problems in Directed Acyclic Networks</a>
<ul>
<li><a href="#org97e86df">1.1. The Pulling Algorithm</a></li>
<li><a href="#org078a959">1.2. The Reaching Algorithm</a></li>
</ul>
</li>
<li><a href="#orgc0fe6c7">2. Single Source Shortest Path Problems in Networks With No Negative Arc Length</a>
<ul>
<li><a href="#orgda35111">2.1. Dijkstra Algorithm</a></li>
<li><a href="#org97f8cbb">2.2. <span class="todo TODO">TODO</span> Optimization: Bidiretional Search</a></li>
<li><a href="#org75d817c">2.3. <span class="todo TODO">TODO</span> Optimization: Heap</a></li>
<li><a href="#org6a740e9">2.4. <span class="todo TODO">TODO</span> Optimization: Dial's Implementation</a></li>
</ul>
</li>
<li><a href="#org518ff18">3. Single Source Shortest Path Problems in Networks With Arbitrary Arc Lengths</a>
<ul>
<li><a href="#org4e73c31">3.1. <span class="todo TODO">TODO</span> Optimality Condition</a></li>
<li><a href="#org4cf9afb">3.2. <span class="todo TODO">TODO</span> Generic Label-Correcting Algorithm</a></li>
<li><a href="#orgafa0a5a">3.3. <span class="todo TODO">TODO</span> Modified Label-Correcting Algorithm</a></li>
<li><a href="#orgf6d3dd8">3.4. <span class="todo TODO">TODO</span> Detecting Negative Cycles</a></li>
</ul>
</li>
<li><a href="#org83d6678">4. All-Pair Shortest Path Problems in Networks With Arbitrary Arc Lengths</a>
<ul>
<li><a href="#orge7ba0ea">4.1. <span class="todo TODO">TODO</span> Repeated Shortest Path Algorithm</a></li>
<li><a href="#org32f0184">4.2. <span class="todo TODO">TODO</span> Generic Label-Correcting Algorithm</a></li>
<li><a href="#orgff8c0c5">4.3. <span class="todo TODO">TODO</span> Floyd-Warshall Algorithm</a></li>
<li><a href="#org701bd60">4.4. <span class="todo TODO">TODO</span> Detecting Negative Cycles</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org05b87dc" class="outline-2">
<h2 id="org05b87dc"><span class="section-number-2">1</span> Single Source Shortest Path Problems in Directed Acyclic Networks</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>A topological ordering of nodes is available for a directed acyclic network such that for any \((i, j) \in A\), \(i\) appears before \(j\) in the ordering.</li>
<li>Two similar algorithms based on this topological ordering can be established.</li>
<li>The complexity is \(O(m)\) for both algorithms, since each arc is examined exactly once in each execution.</li>
<li>The reaching algorithm is prefered since we usually maintain the adjacent-list \(A(i)\) for node \(i \in N\).</li>
</ul>
</div>

<div id="outline-container-org97e86df" class="outline-3">
<h3 id="org97e86df"><span class="section-number-3">1.1</span> The Pulling Algorithm</h3>
<div class="outline-text-3" id="text-1-1">
<p class="verse">
<b>algorithm</b> Pulling;<br />
<b>begin</b><br />
&#xa0;&#xa0;&#xa0;&#xa0;\(d(s) \leftarrow 0, \mbox{pred}(s) \leftarrow 0\);<br />
&#xa0;&#xa0;&#xa0;&#xa0;\(d(i) \leftarrow \infty\) for all \(i \in N - \{ s \}\);<br />
&#xa0;&#xa0;&#xa0;&#xa0;<b>for</b> each node \(j \in N\) in topological ordering <b>do</b><br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;<b>for</b> all arc \((i, j), i \in N\) <b>do</b><br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;<b>if</b> \(d(j) > d(i) + c_{ij}\) <b>then</b><br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;<b>begin</b><br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;\(d(j) \leftarrow d(i) + c_{ij}\);<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;\(\mbox{pred}(i) \leftarrow j\);<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;<b>end</b>;<br />
<b>end</b>;<br />
</p>
</div>
</div>

<div id="outline-container-org078a959" class="outline-3">
<h3 id="org078a959"><span class="section-number-3">1.2</span> The Reaching Algorithm</h3>
<div class="outline-text-3" id="text-1-2">
<p class="verse">
<b>algorithm</b> Reaching;<br />
<b>begin</b><br />
&#xa0;&#xa0;&#xa0;&#xa0;\(d(s) \leftarrow 0, \mbox{pred}(s) \leftarrow 0\);<br />
&#xa0;&#xa0;&#xa0;&#xa0;\(d(i) \leftarrow \infty\) for all \(i \in N - \{ s \}\);<br />
&#xa0;&#xa0;&#xa0;&#xa0;<b>for</b> each node \(i \in N\) in topological ordering <b>do</b><br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;<b>for</b> all arc \((i, j), j \in N\) <b>do</b><br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;<b>if</b> \(d(j) > d(i) + c_{ij}\) <b>then</b><br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;<b>begin</b><br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;\(d(j) \leftarrow d(i) + c_{ij}\);<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;\(\mbox{pred}(i) \leftarrow j\);<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;<b>end</b>;<br />
<b>end</b>;<br />
</p>
</div>
</div>
</div>

<div id="outline-container-orgc0fe6c7" class="outline-2">
<h2 id="orgc0fe6c7"><span class="section-number-2">2</span> Single Source Shortest Path Problems in Networks With No Negative Arc Length</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgda35111" class="outline-3">
<h3 id="orgda35111"><span class="section-number-3">2.1</span> Dijkstra Algorithm</h3>
<div class="outline-text-3" id="text-2-1">
<p class="verse">
<b>algorithm</b> Dijkstra's;<br />
<b>begin</b><br />
&#xa0;&#xa0;&#xa0;&#xa0;\(S \leftarrow \emptyset, \bar S \leftarrow N\);<br />
&#xa0;&#xa0;&#xa0;&#xa0;\(d(s) \leftarrow 0, \mbox{pred}(s) \leftarrow 0\);<br />
&#xa0;&#xa0;&#xa0;&#xa0;<b>d(s) &larr; &infin;</b> for all \(i \in N - \{ s \}\);<br />
&#xa0;&#xa0;&#xa0;&#xa0;<b>while</b> \(|S| < n\) <b>do</b><br />
&#xa0;&#xa0;&#xa0;&#xa0;<b>begin</b><br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;let \(i \in \bar S\) be some node such that \(d(i) = \mbox{min} \{ d(j) : j \in \bar S \}\);<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;\(S \leftarrow S \cup \{ i \}\);<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;\(\bar S \leftarrow \bar S - \{ i \}\);<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;<b>for</b> each \((i, j) \in A(i)\) <b>do</b><br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;<b>if</b> \(d(j) > d(i) > c_{ij}\) <b>then</b><br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;<b>begin</b><br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;\(d(j) \leftarrow d(i) + c_{ij}\);<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;\(\mbox{pred}(j) \leftarrow i\);<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;<b>end</b>;<br />
&#xa0;&#xa0;&#xa0;&#xa0;<b>end</b>;<br />
<b>end</b>;<br />
</p>
<ul class="org-ul">
<li>The node selecting operations cost \(O(n^2)\).</li>
<li>The distance updating operations cost \(O(m)\).</li>
<li>Since the upper bound of \(m\) is \(O(n^2)\), Dijkstra's algorithm runs in \(O(n^2)\).</li>
</ul>
</div>
</div>

<div id="outline-container-org97f8cbb" class="outline-3">
<h3 id="org97f8cbb"><span class="section-number-3">2.2</span> <span class="todo TODO">TODO</span> Optimization: Bidiretional Search</h3>
</div>
<div id="outline-container-org75d817c" class="outline-3">
<h3 id="org75d817c"><span class="section-number-3">2.3</span> <span class="todo TODO">TODO</span> Optimization: Heap</h3>
</div>
<div id="outline-container-org6a740e9" class="outline-3">
<h3 id="org6a740e9"><span class="section-number-3">2.4</span> <span class="todo TODO">TODO</span> Optimization: Dial's Implementation</h3>
</div>
</div>

<div id="outline-container-org518ff18" class="outline-2">
<h2 id="org518ff18"><span class="section-number-2">3</span> Single Source Shortest Path Problems in Networks With Arbitrary Arc Lengths</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org4e73c31" class="outline-3">
<h3 id="org4e73c31"><span class="section-number-3">3.1</span> <span class="todo TODO">TODO</span> Optimality Condition</h3>
</div>
<div id="outline-container-org4cf9afb" class="outline-3">
<h3 id="org4cf9afb"><span class="section-number-3">3.2</span> <span class="todo TODO">TODO</span> Generic Label-Correcting Algorithm</h3>
</div>
<div id="outline-container-orgafa0a5a" class="outline-3">
<h3 id="orgafa0a5a"><span class="section-number-3">3.3</span> <span class="todo TODO">TODO</span> Modified Label-Correcting Algorithm</h3>
</div>
<div id="outline-container-orgf6d3dd8" class="outline-3">
<h3 id="orgf6d3dd8"><span class="section-number-3">3.4</span> <span class="todo TODO">TODO</span> Detecting Negative Cycles</h3>
</div>
</div>

<div id="outline-container-org83d6678" class="outline-2">
<h2 id="org83d6678"><span class="section-number-2">4</span> All-Pair Shortest Path Problems in Networks With Arbitrary Arc Lengths</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orge7ba0ea" class="outline-3">
<h3 id="orge7ba0ea"><span class="section-number-3">4.1</span> <span class="todo TODO">TODO</span> Repeated Shortest Path Algorithm</h3>
</div>
<div id="outline-container-org32f0184" class="outline-3">
<h3 id="org32f0184"><span class="section-number-3">4.2</span> <span class="todo TODO">TODO</span> Generic Label-Correcting Algorithm</h3>
</div>
<div id="outline-container-orgff8c0c5" class="outline-3">
<h3 id="orgff8c0c5"><span class="section-number-3">4.3</span> <span class="todo TODO">TODO</span> Floyd-Warshall Algorithm</h3>
</div>
<div id="outline-container-org701bd60" class="outline-3">
<h3 id="org701bd60"><span class="section-number-3">4.4</span> <span class="todo TODO">TODO</span> Detecting Negative Cycles</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: xiaoyao</p>
<p class="date">Created: 2019-01-03 Thu 23:51</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
